       IDENTIFICATION DIVISION.
       PROGRAM-ID. CELSIUS-TO-FAHRENHEIT.
       DATA DIVISION.
       LINKAGE SECTION.
       01 CELSIUS-VALUE PIC S9(3)V99.
       01 FAHRENHEIT-VALUE PIC S9(3)V99.
       PROCEDURE DIVISION USING CELSIUS-VALUE FAHRENHEIT-VALUE.
           COMPUTE FAHRENHEIT-VALUE = CELSIUS-VALUE * 9 / 5 + 32
           GOBACK.
