>>source format free
identification division. program-id. CEE3ABD.
procedure division.
  display 'LOCAL-CEE3ABD/0 called' upon syserr
  stop run returning 12.
